src/inventory/testdata/load_testdata
#### plugins_test.json
{
	"plugins": [{
		"type": "HTTPInput",
		"config": {
			"headers": {
				"name": ["bar"]
			},
			"method": "POST",
			"plugin_name": "test-httpinput",
			"url": "/test"
		}
	}, {
		"type": "GraphiteValidator",
		"config": {
			"plugin_name": "test-graphitevalidator"
		}
	}, {
		"type": "GraphiteGidExtractor",
		"config": {
			"plugin_name": "test-graphitegidextractor"
		}
	}, {
		"type": "JSONGidExtractor",
		"config": {
			"plugin_name": "test-jsongidextractor"
		}
	}, {
		"type": "JSONValidator",
		"config": {
			"plugin_name": "test-jsonvalidator",
			"schema": "{\"title\": \"Record\",\"type\": \"object\",\"properties\": {\"name\": {\"type\": \"string\"}}, \"required\": [\"name\"]}"
		}
	}, {
		"type": "KafkaOutput",
		"config": {
			"brokers": ["192.168.98.130:9092"],
			"client_id": "apigw",
			"plugin_name": "test-kafkaoutput",
			"topic": "test"
		}
	}, {
		"type": "GWProtoAdaptor",
		"config": {
			"plugin_name": "test-gwprotoadaptor"
		}
	}, {
		"type": "ThroughputRateLimiter",
		"config": {
			"plugin_name": "test-throughputratelimiter",
			"tps": "100"
		}
	}]
}

#### pipelines_test.json
{
	"pipelines": [{
		"type": "LinearPipeline",
		"config": {
			"pipeline_name": "test-jsonpipeline",
			"plugin_names": ["test-httpinput", "test-throughputratelimiter", "test-jsonvalidator", "test-jsongidextractor", "test-kafkaoutput"]
		}
	}]
}

#### workload
{
	"name": "test-workload",
	"gid": "6adbd887-4794-4144-b53a-490deba65ef5"
}

#### Apache bench (aka ab, compile with ssl support)
$ ab -n 5000 -c 100 -H "name:bar" -T "application/json" -p ~/load -f TSL1.2 https://127.0.0.1:10443/test
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:
Server Hostname:        127.0.0.1
Server Port:            10443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128

Document Path:          /test
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   49.330 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      485000 bytes
Total body sent:        1135000
HTML transferred:       0 bytes
Requests per second:    101.36 [#/sec] (mean)
Time per request:       986.606 [ms] (mean)
Time per request:       9.866 [ms] (mean, across all concurrent requests)
Transfer rate:          9.60 [Kbytes/sec] received
                        22.47 kb/s sent
                        32.07 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   16  57.4      5     623
Processing:     2  961 115.4    994    1083
Waiting:        1  960 118.5    994    1081
Total:        142  977  91.1   1000    1268

Percentage of the requests served within a certain time (ms)
  50%   1000
  66%   1000
  75%   1001
  80%   1001
  90%   1003
  95%   1009
  98%   1024
  99%   1046
 100%   1268 (longest request)